In [1]:
import numpy as np
import pandas as pd

In [2]:
sse = pd.read_csv(r"C:\Users\hrish\Desktop\Summer Project\Data\UK\FTSE 100 Index Data.csv")

In [3]:
sse.head(5)

,Date,Open,High,Low,Close,Adj Close,Volume
0,02-01-2015,6566.100098,6607.899902,6510.600098,6547.799805,6547.799805,367562200
1,05-01-2015,6547.799805,6576.700195,6404.500000,6417.200195,6417.200195,728001100
2,06-01-2015,6417.200195,6452.700195,6328.600098,6366.500000,6366.500000,769463100
3,07-01-2015,6366.500000,6459.700195,6366.500000,6419.799805,6419.799805,688211500
4,08-01-2015,6419.799805,6580.799805,6419.799805,6570.000000,6570.000000,882740200

In [4]:
sse.drop(['Open','High','Low','Adj Close'], axis =1, inplace=True)

In [5]:
sse.head()

         Date        Close     Volume
0  02-01-2015  6547.799805  367562200
1  05-01-2015  6417.200195  728001100
2  06-01-2015  6366.500000  769463100
3  07-01-2015  6419.799805  688211500
4  08-01-2015  6570.000000  882740200

In [6]:
iip = pd.read_excel(r"C:\Users\hrish\Desktop\Summer Project\Data\UK\UK IIP.xlsx")

In [7]:
iip.head()

      Proxy   Index
0  Jan-2015   99.34
1  Feb-2015   99.74
2  Mar-2015  100.24
3  Apr-2015  100.34
4  May-2015  100.55

In [8]:
c = []; v=[]; i = 0
f = iip.shape[0]
while (i < f):
    date = pd.datetime.strptime(iip['Proxy'][i], "%b-%Y")
    c.append(date.month)
    v.append(date.year)
    i = i+1

iip['Month'] = c
iip['Year'] = v

In [9]:
sse['Date'][0]

'02-01-2015'

In [10]:
date = pd.datetime.strptime(sse['Date'][0], "%d-%m-%Y")

In [11]:
date

datetime.datetime(2015, 1, 2, 0, 0)

In [12]:
date.year

2015

In [13]:
date.month

1

In [14]:
a = sse.shape[0]

In [15]:
c = []; i = 0
g=[]; v=[]
while (i < a):
    date = pd.datetime.strptime(sse['Date'][i], "%d-%m-%Y")
    c.append(date.month)
    g.append(date.day)
    v.append(date.year)
    i = i+1

In [17]:
len(c) == a

True

In [18]:
sse['Month'] = c
sse['Day'] =g
sse['Year'] = v

In [19]:
sse.tail()

            Date        Close     Volume  Month  Day  Year
1048  22-02-2019  7178.600098  646718000      2   22  2019
1049  25-02-2019  7183.700195  644937500      2   25  2019
1050  26-02-2019  7151.100098  865719700      2   26  2019
1051  27-02-2019  7107.200195  870721000      2   27  2019
1052  28-02-2019  7074.700195  979616900      2   28  2019

In [20]:
row = iip.shape[0]

In [21]:
d =[]

for x in range(0,row):
    for y in range(0,a):
        if (iip['Month'][x]== sse['Month'][y] and iip['Year'][x]==sse['Year'][y]):  
            d.append(iip['Index'][x]) 
            
        else: continue

In [22]:
sse["IIP"] = d

In [23]:
sse.head()

         Date        Close     Volume  Month  Day  Year    IIP
0  02-01-2015  6547.799805  367562200      1    2  2015  99.34
1  05-01-2015  6417.200195  728001100      1    5  2015  99.34
2  06-01-2015  6366.500000  769463100      1    6  2015  99.34
3  07-01-2015  6419.799805  688211500      1    7  2015  99.34
4  08-01-2015  6570.000000  882740200      1    8  2015  99.34

In [40]:
by = pd.read_csv(r"C:\Users\hrish\Desktop\Summer Project\Data\UK\United Kingdom 1-Year Bond Yield Historical Data.csv")

In [41]:
by.head()

           Date  Price   Open   High    Low Change %
0  Feb 28, 2019  0.819  0.817  0.840  0.804   -0.73%
1  Feb 27, 2019  0.825  0.799  0.848  0.787    4.56%
2  Feb 26, 2019  0.789  0.764  0.800  0.763    2.87%
3  Feb 25, 2019  0.767  0.750  0.782  0.750    2.13%
4  Feb 23, 2019  0.751  0.751  0.751  0.751   -2.34%

In [42]:
by.drop(['Open','High','Low'], axis =1, inplace= True)

In [43]:
by.head()

           Date  Price Change %
0  Feb 28, 2019  0.819   -0.73%
1  Feb 27, 2019  0.825    4.56%
2  Feb 26, 2019  0.789    2.87%
3  Feb 25, 2019  0.767    2.13%
4  Feb 23, 2019  0.751   -2.34%

In [44]:
d1 = pd.datetime.strptime(by['Date'][0], "%b %d, %Y")

In [45]:
d1.month

2

In [46]:
by.tail()

              Date  Price Change %
1236  Jan 07, 2015  0.322    6.27%
1237  Jan 06, 2015  0.303   -2.57%
1238  Jan 05, 2015  0.311    2.64%
1239  Jan 03, 2015  0.303    2.71%
1240  Jan 02, 2015  0.295   -4.22%

In [47]:
b = by.shape[0]

In [48]:
r = []
t =[]
f=[]
for i in range(0,b):
    d1 = pd.datetime.strptime(by['Date'][i], "%b %d, %Y")
    r.append(d1.month)
    t.append(d1.year)
    f.append(d1.day)
    i = i+1

In [49]:
by['Day'] = f
by['Month']= r
by['Year'] = t

In [50]:
len(t) == b

True

In [51]:
sse['test']=np.zeros(a, dtype=int)
sse.head()

         Date        Close     Volume  Month  Day  Year    IIP  test
0  02-01-2015  6547.799805  367562200      1    2  2015  99.34     0
1  05-01-2015  6417.200195  728001100      1    5  2015  99.34     0
2  06-01-2015  6366.500000  769463100      1    6  2015  99.34     0
3  07-01-2015  6419.799805  688211500      1    7  2015  99.34     0
4  08-01-2015  6570.000000  882740200      1    8  2015  99.34     0

In [52]:
for y in range(0,a):
    for x in range(0,b):
        if (sse['Day'][y] == by['Day'][x] and sse['Month'][y] == by['Month'][x] and sse['Year'][y]== by['Year'][x]):
            sse['test'][y] = 1
        else: continue

C:\Users\hrish\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  after removing the cwd from sys.path.

In [53]:
for y in range(0,a):
    if(sse['test'][y] == 0):
        print(sse['Date'][y])
    else : continue

In [54]:
m =[]
n = []
for y in range(0,a):
    for x in range(0,b):
        if (sse['Day'][y] == by['Day'][x] and sse['Month'][y] == by['Month'][x] and sse['Year'][y]== by['Year'][x]):  
            m.append(by['Price'][x]) 
            n.append(by['Change %'][x])
        else: continue

In [40]:
len(m) == a

True

In [55]:
sse['Interest Rate'] = m
sse['Change in IR'] = n

In [56]:
sse.tail()

,Date,Close,Volume,Month,Day,Year,IIP,test,Interest Rate,Change in IR
1048,22-02-2019,7178.600098,646718000,2,22,2019,104.28,1,0.769,-0.13%
1049,25-02-2019,7183.700195,644937500,2,25,2019,104.28,1,0.767,2.13%
1050,26-02-2019,7151.100098,865719700,2,26,2019,104.28,1,0.789,2.87%
1051,27-02-2019,7107.200195,870721000,2,27,2019,104.28,1,0.825,4.56%
1052,28-02-2019,7074.700195,979616900,2,28,2019,104.28,1,0.819,-0.73%

In [57]:
sse.drop(['Day','Month','Year', 'test'], axis =1, inplace = True)

In [58]:
sse.head()

         Date        Close     Volume    IIP  Interest Rate Change in IR
0  02-01-2015  6547.799805  367562200  99.34          0.295       -4.22%
1  05-01-2015  6417.200195  728001100  99.34          0.311        2.64%
2  06-01-2015  6366.500000  769463100  99.34          0.303       -2.57%
3  07-01-2015  6419.799805  688211500  99.34          0.322        6.27%
4  08-01-2015  6570.000000  882740200  99.34          0.346        7.45%

In [59]:
sse.to_csv(r'C:\Users\hrish\Desktop\Summer Project\Data\FTSE 100 SE Final.csv')